app/Models/Mahasiswa_model.php

    public function getMahasiswa($id = false)
    {
        if($id === false){
            return $this->findAll();
        }else{
            return $this->getWhere(['id_mahasiswa' => $id]);
---
SELECT *
FROM `tbl_mahasiswa`
SELECT *
FROM `tbl_mahasiswa`
WHERE `id_mahasiswa` = '2'

    public function editMahasiswa($data,$id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_mahasiswa', $id);
        return $builder->update($data);
---
UPDATE `tbl_mahasiswa` SET `nama` = 'meong', `nim` = '4'
WHERE `id_mahasiswa` = '5'