app/Models/Pendaftaran_model.php

SELECT `tbl_pendaftaran`.`id_praktikum` AS `id_praktikum`, `tbl_mahasiswa`.`nama` AS `nama`, `tbl_praktikum`.`nama_praktikum` AS `nama_praktikum`, `tbl_mahasiswa`.`nim` AS `nim`
FROM `tbl_mahasiswa`
JOIN `tbl_pendaftaran` ON `tbl_mahasiswa`.`nim` = `tbl_pendaftaran`.`nim`
JOIN `tbl_praktikum` ON `tbl_pendaftaran`.`id_praktikum` = `tbl_praktikum`.`id_praktikum`
---
    public function getPendaftaran($id = false)
    {
        $db      = \Config\Database::connect();

        $builder = $db->table('tbl_mahasiswa');
        $builder->select('tbl_pendaftaran.id_praktikum AS id_praktikum, tbl_mahasiswa.nama AS nama, tbl_praktikum.nama_praktikum AS nama_praktikum, tbl_mahasiswa.nim AS nim');
        $builder->join('tbl_pendaftaran', 'tbl_mahasiswa.nim = tbl_pendaftaran.nim');
        $builder->join('tbl_praktikum', 'tbl_pendaftaran.id_praktikum = tbl_praktikum.id_praktikum');
        $query = $builder->get()->getResultArray();