app/Models/Praktikum_model.php

SELECT *
FROM `tbl_praktikum`
---
    public function getPraktikum($id = false)
    {
        if($id === false){
            return $this->findAll();

INSERT INTO `tbl_praktikum` (`nama_praktikum`) VALUES ('percobaan')
---
    public function savePraktikum($data)
    {
        $builder = $this->db->table($this->table);
        return $builder->insert($data);

UPDATE `tbl_praktikum` SET `nama_praktikum` = 'percobaan kebanyakan'
WHERE `id_praktikum` = '4'
---
    public function editPraktikum($data,$id)
    {
        $builder = $this->db->table($this->table);
        $builder->where('id_praktikum', $id);
        return $builder->update($data);